Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: <<user-initiated-logout,User-initiated logout>> will log the user out of the OIDC provider. If it is used as single sign-on, it might not be what you require. If, for example, your OIDC provider is Google, you will be logged out from Google and its services. Instead, the user might just want to log out of that specific application. Another use case might be when the OIDC provider does not have a logout endpoint.
ja_jp: xref:user-initiated-logout[ユーザーによるログアウト] は、ユーザーをOIDCプロバイダーからログアウトさせます。シングルサインオンとして使用される場合、それはあなたが必要とするものではないかもしれません。例えば、あなたのOIDCプロバイダがGoogleの場合、あなたはGoogleとそのサービスからログアウトすることになります。代わりに、ユーザーは特定のアプリケーションからログアウトしたいだけかもしれません。もう1つのユースケースは、OIDCプロバイダがログアウトエンドポイントを持っていない場合です。

source: <<xml-mapping,XML mapping>> files are expected to have a unique path.
ja_jp: <<xml-mapping,XML mapping>> ファイルは一意のパスを持つことが期待されます。

source: <a class="anchor" href="#being-reactive"></a>Being reactive
ja_jp: <a class="anchor" href="#being-reactive"></a>リアクティブであること

source: <a class="anchor" href="#event-driven-architectures"></a>Event-driven Architectures
ja_jp: <a class="anchor" href="#event-driven-architectures"></a> イベントドリブンなアーキテクチャー

source: <a class="anchor" href="#functions-as-a-service-and-serverless"></a>Functions as a Service and Serverless
ja_jp: <a class="anchor" href="#functions-as-a-service-and-serverless"></a>Functions as a Service とサーバーレス

source: <a class="anchor" href="#http-microservices"></a>HTTP microservices
ja_jp: <a class="anchor" href="#http-microservices"></a>HTTP マイクロサービス

source: <a class="status-label status-deprecated" title="This extension is likely to be replaced or removed in a future version" href="#extension-status-note">deprecated</a>
ja_jp: <a class="status-label status-deprecated" title="このエクステンションは、将来のバージョンで置き換えられるか、削除される可能性があります" href="#extension-status-note">非推奨</a>

source: <a class="status-label status-experimental" title="This extension requests early feedback to mature the idea" href="#extension-status-note">experimental</a>
ja_jp: <a class="status-label status-experimental" title="このエクステンションは、アイデアを成熟させるために早期のフィードバックを求めています" href="#extension-status-note">experimental</a>

source: <a class="status-label status-preview" title="This extension's backward compatibility and presence in the ecosystem is not guaranteed" href="#extension-status-note">preview</a>
ja_jp: <a class="status-label status-preview" title="このエクステンションの後方互換性およびエコシステムにおける存在は保証されません" href="#extension-status-note">プレビュー</a>

source: <a class="status-label status-stable" title="This extension's backward compatibility and presence in the ecosystem are taken very seriously" href="#extension-status-note">stable</a>
ja_jp: <a class="status-label status-stable" title="このエクステンションの旧バージョンとの互換性およびエコシステムにおける存在は、非常に重要視されています" href="#extension-status-note">安定</a>

source: <a href="#">62 Contributors</a>
ja_jp: <a href="#">62 人のコントリビューター</a>

source: <a href="#">Clear All</a>
ja_jp: <a href="#">すべてクリア</a>

source: <a href="#">Documentation</a>
ja_jp: <a href="#">ドキュメント</a>

source: <a href="#">Extension Repo</a>
ja_jp: <a href="#">エクステンションリポジトリー</a>

source: <a href="#">JBeret Project</a>
ja_jp: <a href="#">JBeret プロジェクト</a>

source: <a href="#">JBeret makes you jump higher</a>
ja_jp: <a href="#">JBeret はあなたをより高くジャンプさせる</a>

source: <a href="#">Passing</a>
ja_jp: <a href="#">合格</a>

source: <a href="#">Platform: Foo</a>
ja_jp: <a href="#">プラットフォーム: Foo</a>

source: <a href="#">Use Jberet to do something cool</a>
ja_jp: <a href="#">JBeret を使って何か素晴らしいことをする</a>

source: <a href="#">Version 0.0.2</a>
ja_jp: <a href="#">バージョン 0.0.2</a>

source: <a href="#">Version 1.1</a>
ja_jp: <a href="#">バージョン 1.1</a>

source: <a href="/container-first">Container First</a>
ja_jp: <a href="/container-first">コンテナ・ファースト</a>

source: <a href="/container-first">Learn more</a>>
ja_jp: <a href="/container-first">詳細</a>>

source: <a href="/continuum">Learn more</a>>
ja_jp: <a href="/continuum">詳細</a>>

source: <a href="/continuum">Reactive Core</a>
ja_jp: <a href="/continuum">リアクティブ・コア</a>

source: <a href="/developer-joy">Developer Joy</a>
ja_jp: <a href="/developer-joy">開発者満足</a>

source: <a href="/developer-joy">Learn more</a>
ja_jp: <a href="/developer-joy">さらに詳しく</a>

source: <a href="/developer-joy">Learn more</a>>
ja_jp: <a href="/developer-joy">詳細</a>>

source: <a href="/performance">Performance</a>
ja_jp: <a href="/performance">パフォーマンス</a>

source: <a href="/standards">Community and Standards</a>
ja_jp: <a href="/standards">コミュニティと標準仕様</a>

source: <a href="/standards">Learn more</a>>
ja_jp: <a href="/standards">詳細</a>>

source: <a href="https://code.quarkus.io" class="button-cta secondary white">START CODING</a>
ja_jp: <a href="https://code.quarkus.io" class="button-cta secondary white">コーディングを開始</a>

source: <a href="https://code.quarkus.io">Start Coding</a> with Quarkus {{ site.data.versions.quarkus.version }} [<a href="{{ site.data.versions.quarkus.announce }}">announce</a>|<a href="https://github.com/quarkusio/quarkus/releases/tag/{{ site.data.versions.quarkus.version }}">changelog</a>]
ja_jp: Quarkus {{ site.data.versions.quarkus.version }} で <a href="https://code.quarkus.io">コーディングを開始</a> [<a href="{{ site.data.versions.quarkus.announce }}">announce</a>|<a href="https://github.com/quarkusio/quarkus/releases/tag/{{ site.data.versions.quarkus.version }}">changelog</a>]

source: <a href="https://developers.redhat.com/e-books/applied-ai-enterprise-java-development" alt="Applied AI for Enterprise Java Development link">
ja_jp: <a href="https://developers.redhat.com/e-books/applied-ai-enterprise-java-development" alt="エンタープライズJava開発のための応用AIへのリンク">

source: <a href="https://github.com/orgs/quarkusio/projects/13/views/1" class="{% if page.url contains '/roadmap/' %}active{% endif %}">ROADMAP</a>
ja_jp: <a href="https://github.com/orgs/quarkusio/projects/13/views/1" class="{% if page.url contains '/roadmap/' %}active{% endif %}">ロードマップ</a>

source: <a href="https://github.com/quarkusio/quarkus/discussions/categories/events">Check out the "Events" section of Quarkus Discussions</a> for additional community related events.
ja_jp: 追加のコミュニティー関連イベントについては、<a href="https://github.com/quarkusio/quarkus/discussions/categories/events">Quarkus Discussions の「Events」セクション</a>をご確認ください。

source: <a href="https://hub.quarkiverse.io" class="{% if page.url contains 'hub.quarkiverse.io' %}active{% endif %}">SHARE EXTENSIONS</a>
ja_jp: <a href="https://hub.quarkiverse.io" class="{% if page.url contains 'hub.quarkiverse.io' %}active{% endif %}">エクステンションの共有</a>

source: <a href="https://pt.quarkus.io{{ page.url }}">PORTUGUÊS (BR)</a>
ja_jp: <a href="https://pt.quarkus.io{{ page.url }}">ポルトガル（BR）</a>

source: <a href="https://quarkus.io/extensions/" class="{% if page.url contains '/extensions/' %}active{% endif %}">BROWSE EXTENSIONS</a>
ja_jp: <a href="https://quarkus.io/extensions/" class="{% if page.url contains '/extensions/' %}active{% endif %}">エクステンションを探す</a>

source: <a href="https://zulip.com/" title="Support Zulip chat" alt="zulip logo">
ja_jp: <a href="https://zulip.com/" title="サポート Zulip chat" alt="zulip logo">

source: <a href="{{ site.data.versions.quarkus.announce }}">Read the release notes</a>
ja_jp: <a href="{{ site.data.versions.quarkus.announce }}">リリースノート</a>

source: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">WHAT IS QUARKUS?</a>
ja_jp: <a href="{{site.baseurl}}/about" class="{% if page.url contains '/about/' %}active{% endif %}">QUARKUSとは何か？</a>

source: <a href="{{site.baseurl}}/ai" class="{% if page.url contains '/ai/' %}active{% endif %}">AI OVERVIEW</a>
ja_jp: <a href="{{site.baseurl}}/ai" class="{% if page.url contains '/ai/' %}active{% endif %}">AI概要</a>

source: <a href="{{site.baseurl}}/benefactors" class="{% if page.url contains '/benefactors/' %}active{% endif %}">BENEFACTORS</a>
ja_jp: <a href="{{site.baseurl}}/benefactors" class="{% if page.url contains '/benefactors/' %}active{% endif %}">貢献者</a>

source: <a href="{{site.baseurl}}/blog" class="{% if page.url contains '/blog/' %}active{% endif %}">BLOG</a>
ja_jp: <a href="{{site.baseurl}}/blog" class="{% if page.url contains '/blog/' %}active{% endif %}">ブログ</a>

source: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">BOOKS</a>
ja_jp: <a href="{{site.baseurl}}/books" class="{% if page.url contains '/books/' %}active{% endif %}">書籍</a>

source: <a href="{{site.baseurl}}/catalog">Extension Catalog</a> <i class="fas fa-chevron-right"></i> {{ page.title }}
ja_jp: <a href="{{site.baseurl}}/catalog">エクステンションカタログ</a> <i class="fas fa-chevron-right"></i> {{ page.title }}

source: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">CONTAINER FIRST</a>
ja_jp: <a href="{{site.baseurl}}/container-first" class="{% if page.url contains '/container-first/' %}active{% endif %}">コンテナ・ファースト</a>

source: <a href="{{site.baseurl}}/createextensions"> Learn How </a>
ja_jp: <a href="{{site.baseurl}}/createextensions"> 方法を学ぶ </a>

source: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">DEVELOPER JOY</a>
ja_jp: <a href="{{site.baseurl}}/developer-joy" class="{% if page.url contains '/developer-joy/' %}active{% endif %}">開発者満足</a>

source: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">DISCUSSION</a>
ja_jp: <a href="{{site.baseurl}}/discussion" class="{% if page.url contains '/discussion/' %}active{% endif %}">ディスカッション</a>

source: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">EVENTS</a>
ja_jp: <a href="{{site.baseurl}}/events" class="{% if page.url contains '/events/' %}active{% endif %}">イベント</a>

source: <a href="{{site.baseurl}}/faq/#what-is-a-quarkus-extension" class="{% if page.url contains 'what-is-a-quarkus-extension' %}active{% endif %}">USE EXTENSIONS</a>
ja_jp: <a href="{{site.baseurl}}/faq/#what-is-a-quarkus-extension" class="{% if page.url contains 'what-is-a-quarkus-extension' %}active{% endif %}">エクステンションの使用</a>

source: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">GET STARTED</a>
ja_jp: <a href="{{site.baseurl}}/get-started" class="{% if page.url contains '/get-started/' %}active{% endif %}">入門</a>

source: <a href="{{site.baseurl}}/get-started/" class="button-cta">Get Started with Quarkus</a> <a href="{{site.baseurl}}/guides/" class="button-cta">Read the Guides</a>
ja_jp: <a href="{{site.baseurl}}/get-started/" class="button-cta">Quarkus入門</a> <a href="{{site.baseurl}}/guides/" class="button-cta">ガイドを読む</a>

source: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">DOCUMENTATION</a>
ja_jp: <a href="{{site.baseurl}}/guides" class="{% if page.url contains '/guides/' %}active{% endif %}">ドキュメント</a>

source: <a href="{{site.baseurl}}/guides/writing-extensions" class="{% if page.url contains '/guides/writing-extensions' %}active{% endif %}">CREATE EXTENSIONS</a>
ja_jp: <a href="{{site.baseurl}}/guides/writing-extensions" class="{% if page.url contains '/guides/writing-extensions' %}active{% endif %}">エクステンションの作成</a>

source: <a href="{{site.baseurl}}/insights" class="{% if page.url contains '/insights/' %}active{% endif %}">PODCAST</a>
ja_jp: <a href="{{site.baseurl}}/insights" class="{% if page.url contains '/insights/' %}active{% endif %}">ポッドキャスト</a>

source: <a href="{{site.baseurl}}/java-for-ai" class="{% if page.url contains '/java-for-ai/' %}active{% endif %}">JAVA FOR AI</a>
ja_jp: <a href="{{site.baseurl}}/java-for-ai" class="{% if page.url contains '/java-for-ai/' %}active{% endif %}">AI向けJAVA</a>

source: <a href="{{site.baseurl}}/newsletter" class="{% if page.url contains '/newsletter/' %}active{% endif %}">NEWSLETTER</a>
ja_jp: <a href="{{site.baseurl}}/newsletter" class="{% if page.url contains '/newsletter/' %}active{% endif %}">ニュースレター</a>

source: <a href="{{site.baseurl}}/performance" class="{% if page.url contains '/performance/' %}active{% endif %}">PERFORMANCE</a>
ja_jp: <a href="{{site.baseurl}}/performance" class="{% if page.url contains '/performance/' %}active{% endif %}">パフォーマンス</a>

source: <a href="{{site.baseurl}}/qtips" class="{% if page.url contains '/qtips/' %}active{% endif %}">"Q" TIP VIDEOS</a>
ja_jp: <a href="{{site.baseurl}}/qtips" class="{% if page.url contains '/qtips/' %}active{% endif %}">"Q" Tipsビデオ</a>

source: <a href="{{site.baseurl}}/quarkus-for-ai" class="{% if page.url contains '/quarkus-and-ai/' %}active{% endif %}">WHY QUARKUS FOR AI</a>
ja_jp: <a href="{{site.baseurl}}/quarkus-for-ai" class="{% if page.url contains '/quarkus-and-ai/' %}active{% endif %}">AIにQuarkusを使う理由</a>

source: <a href="{{site.baseurl}}/quarkus3/" class="button-cta">Learn More about 3</a>
ja_jp: <a href="{{site.baseurl}}/quarkus3/" class="button-cta">3について詳しく</a>

source: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">STANDARDS</a>
ja_jp: <a href="{{site.baseurl}}/standards" class="{% if page.url contains '/standards/' %}active{% endif %}">標準</a>

source: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">SUPPORT</a>
ja_jp: <a href="{{site.baseurl}}/support/" class="{% if page.url contains '/support/' %}active{% endif %}">サポート</a>

source: <a href="{{site.baseurl}}/userstories/" class="{% if page.url contains '/userstories/' %}active{% endif %}">USER STORIES</a>
ja_jp: <a href="{{site.baseurl}}/userstories/" class="{% if page.url contains '/userstories/' %}active{% endif %}">ユーザーストーリー</a>

source: <a href="{{site.baseurl}}/versatility" class="{% if page.url contains '/versatility/' %}active{% endif %}">VERSATILITY</a>
ja_jp: <a href="{{site.baseurl}}/versatility" class="{% if page.url contains '/versatility/' %}active{% endif %}">多用途性</a>

source: <a href="{{site.baseurl}}/working-groups" class="{% if page.url contains '/working-groups/' %}active{% endif %}">WORKING GROUPS</a>
ja_jp: <a href="{{site.baseurl}}/working-groups" class="{% if page.url contains '/working-groups/' %}active{% endif %}">ワーキンググループ</a>

source: <a href="{{site.baseurl}}/worldtour/">Learn more about the Quarkus World Tour</a>
ja_jp: <a href="/worldtour/">ワールドツアーの詳細についてはこちら</a>。

source: <code>chunk</code> - A simple Job that reads, processes, and stores data from a file.
ja_jp: <code>chunk</code> - ファイルからデータを読み込み、処理し、保存するシンプルなジョブです。

source: <code>jdbc-repository</code> - A Job that uses a jdbc datasource to store JBeret and Job metadata.
ja_jp: <code>jdbc-repository</code> - JBeret およびジョブのメタデータを保存するために JDBC データソースを使用するジョブです。

source: <code>scheduler</code> - Schedule a Job to run every 10 seconds
ja_jp: <code>scheduler</code> - 10 秒ごとに実行されるジョブをスケジュールする

source: <i class="fa fa-chevron-right"></i><a href="/continuum/">Learn more about Reactive</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="/continuum/">リアクティブの詳細</a>

source: <i class="fa fa-chevron-right"></i><a href="/developer-joy/">Learn more about Developer Joy</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="/developer-joy/">開発者満足の詳細</a>

source: <i class="fa fa-chevron-right"></i><a href="/kubernetes-native/">Learn more about Kubernetes-native</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="/kubernetes-native/">Kubernetes-native の詳細</a>

source: <i class="fa fa-chevron-right"></i><a href="/standards/">Learn more about Standards</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="/standards/">標準の詳細</a>

source: <i class="fa fa-chevron-right"></i><a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">Read the "Enhancing the development loop with Quarkus remote development" blog post </a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">「Quarkusリモート開発による開発ループの強化」ブログ記事を読む </a>

source: <i class="fa fa-chevron-right"></i><a href="https://developers.redhat.com/e-books/applied-ai-enterprise-java-development">Download the free ebook now!</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="https://developers.redhat.com/e-books/applied-ai-enterprise-java-development">無料の電子書籍を今すぐダウンロード！</a>

source: <i class="fa fa-chevron-right"></i><a href="https://quarkus.io/blog/reactive-crud-performance-case-study/">"Reactive CRUD Performance: A Case Study" Blog Post</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="https://quarkus.io/blog/reactive-crud-performance-case-study/">「Reactive CRUD Performance: A Case Study」ブログ投稿</a>

source: <i class="fa fa-chevron-right"></i><a href="https://quarkus.io/guides/performance-measure">"Measuring Performance" guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="https://quarkus.io/guides/performance-measure">「パフォーマンス測定」ガイド</a>

source: <i class="fa fa-chevron-right"></i><a href="https://www.commonhaus.org/">Learn more about Commonhaus Foundation.</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="https://www.commonhaus.org/">Commonhaus Foundationについて詳しくはこちら。</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/ai-blueprints">Learn more about using Quarkus for AI</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/ai-blueprints">AIにQuarkusを使用することについて詳しく学ぶ</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/ai-chain-of-thought">Learn about Chain-of-Thought Reasoning</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/ai-chain-of-thought">思考連鎖推論について学ぶ</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/ai-contextual-rag">Learn about Contextual RAG </a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/ai-contextual-rag">コンテキストRAGについて学ぶ</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/ai-frozen-rag">Learn the basics of Frozen RAG</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/ai-frozen-rag">Frozen RAGの基本を学ぶ</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/cli-tooling">Read the CLI Tooling guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/cli-tooling">CLI ツールガイドを読む</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/continuous-testing">Read the Continuous Testing guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/continuous-testing">継続的テストガイドを読む</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Read the "Kubernetes extension" guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/deploying-to-kubernetes">「Kubernetesエクステンション」ガイドを読む</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/dev-services">Read the Dev Services guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/dev-services">Dev Services ガイドを読む</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/dev-ui">Read the Dev UI guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/dev-ui">Dev UI ガイドを読む</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/kubernetes-config">Read the "Kubernetes Config" guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/kubernetes-config">「Kubernetes設定」ガイドを読む</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">Read the Dev Mode guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">開発モードガイドを読む</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">Read the Remote Development Mode guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/maven-tooling#remote-development-mode">リモート開発モードガイドを読む</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">Read the "Micrometer Metrics" guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">「Micrometerメトリクス」ガイドを読む</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/microprofile-health">Read the "Smallrye Health" guide</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/microprofile-health">「SmallRye Health」ガイドを読む</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/opentelemetry">Read the "Using OpenTelemetry" guide </a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/guides/opentelemetry">「OpenTelemetryの使用」ガイドを読む </a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/java-for-ai">Learn more about using Java for AI</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/java-for-ai">AIにJavaを使用することについて詳しく学ぶ</a>

source: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/quarkus-for-ai">Learn more about using Quarkus for AI</a>
ja_jp: <i class="fa fa-chevron-right"></i><a href="{{site.baseurl}}/quarkus-for-ai">AIにQuarkusを使用することについて詳しく学ぶ</a>

source: <input type="checkbox" id="altlanguages" name="altlanguages" value="altlanguages"><label for="altlanguages"> Alternative Languages</label>
ja_jp: <input type="checkbox" id="altlanguages" name="altlanguages" value="altlanguages"><label for="altlanguages"> 代替言語</label>

source: <input type="checkbox" id="busautomation" name="busautomation" value="busautomation"><label for="busautomation"> Business Automation</label>
ja_jp: <input type="checkbox" id="busautomation" name="busautomation" value="busautomation"><label for="busautomation"> ビジネスオートメーション</label>

source: <input type="checkbox" id="cloud" name="cloud" value="cloud"><label for="cloud"> Cloud</label>
ja_jp: <input type="checkbox" id="cloud" name="cloud" value="cloud"><label for="cloud"> クラウド</label>

source: <input type="checkbox" id="compatibility" name="compatibility" value="compatibility"><label for="compatibility"> Compatibility</label>
ja_jp: <input type="checkbox" id="compatibility" name="compatibility" value="compatibility"><label for="compatibility"> 互換性</label>

source: <input type="checkbox" id="core" name="core" value="core"><label for="core"> Core</label>
ja_jp: <input type="checkbox" id="core" name="core" value="core"><label for="core"> コア</label>

source: <input type="checkbox" id="data" name="data" value="data"><label for="data"> Data</label>
ja_jp: <input type="checkbox" id="data" name="data" value="data"><label for="data"> データ</label>

source: <input type="checkbox" id="integration" name="integration" value="integration"><label for="integration"> Integration</label>
ja_jp: <input type="checkbox" id="integration" name="integration" value="integration"><label for="integration"> インテグレーション</label>

source: <input type="checkbox" id="messaging" name="messaging" value="messaging"><label for="messaging"> Messaging</label>
ja_jp: <input type="checkbox" id="messaging" name="messaging" value="messaging"><label for="messaging"> メッセージング</label>

source: <input type="checkbox" id="miscellaneous" name="miscellaneous" value="miscellaneous"><label for="miscellaneous"> Miscellaneous</label>
ja_jp: <input type="checkbox" id="miscellaneous" name="miscellaneous" value="miscellaneous"><label for="miscellaneous"> その他</label>
